Documents/ОтправкаПеремещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтправкаПеремещений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтправкаИнвойсов</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТоварныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппаПеревозчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыПеревозчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаAWB</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИнвойс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппаПеревозчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыПеревозчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗатратыДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РегистраторыЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Затраты</Name>
			<Comment>Затраты на единицу номенклатуры партии</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма затрат на единицу товара (дельта цены)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Comment>Сумма затрат на единицу товара (дельта цены) в USD</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Зарегистрировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОтправкаИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтправкаИнвойсов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОжидаемыеПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОтправкаПеремещений/Ext/ObjectModule.bsl
// © Primus1C  20.11.2023  НАЧАЛО ►

Процедура ПроверкаЗаполнения(Отказ)

	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Ссылка", Ссылка);
	//Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//             |	ТЧОтправкаИнвойсы.Инвойс КАК Инвойс,
	//             |	ТЧОтправкаИнвойсы.Поставка КАК Поставка,
	//             |	ТЧОтправкаИнвойсы.НомерСтроки КАК НомерСтроки,
	//             |	РСОтправкаИнвойсов.Регистратор КАК Регистратор
	//             |ИЗ
	//             |	Документ.Отправка.Инвойсы КАК ТЧОтправкаИнвойсы
	//             |		левое СОЕДИНЕНИЕ РегистрНакопления.ОтправкаИнвойсов КАК РСОтправкаИнвойсов
	//             |		ПО ТЧОтправкаИнвойсы.Инвойс = РСОтправкаИнвойсов.Инвойс
	//             |			И ТЧОтправкаИнвойсы.Поставка = РСОтправкаИнвойсов.Поставка
	//             |ГДЕ
	//             |	ТЧОтправкаИнвойсы.Ссылка = &Ссылка
	//             |	И РСОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	//             |	И РСОтправкаИнвойсов.Регистратор <> &Ссылка
	//             |
	//             |УПОРЯДОЧИТЬ ПО
	//             |	НомерСтроки,
	//             |	Инвойс,
	//             |	Поставка";
	//Выборка = Запр.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Отказ = Истина;	
	//	Сообщить(стрШаблон(НСтр("ru = 'Строка %1: поставка найдена в документе %2!'; en = 'Line %1: delivery found in document %2!'"), Выборка.НомерСтроки, Выборка.Регистратор));
	//КонецЦикла;

КонецПроцедуры
		
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	// РС Затраты    

	ВалютаДоллар = ПараметрыСеанса.БазоваяВалюта;
    Фирма = ПараметрыСеанса.Фирма;

	НаборЗаписей = Движения.Затраты;    

	Если Окончательно Тогда
	
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		             |	Свод.Номенклатура КАК Номенклатура,
		             |	Свод.Партия КАК Партия,
		             |	РаспрЗатрат.Затрата КАК Затрата,
		             //|	РаспрЗатрат.Количество КАК Количество,
		             |	РаспрЗатрат.Цена КАК Цена
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ПеремещениеТовары.Номенклатура КАК Номенклатура,
		             |		ПеремещениеТовары.Партия КАК Партия
		             |	ИЗ
		             |		Документ.Перемещение.Товары КАК ПеремещениеТовары
		             |	ГДЕ
		             |		ПеремещениеТовары.Ссылка В
		             |				(ВЫБРАТЬ
		             |					ТЧ.ТоварныйДокумент
		             |				ИЗ
		             |					Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
		             |				ГДЕ
		             |					ТЧ.Ссылка = &Ссылка)
		             |		И ПеремещениеТовары.Номенклатура В
		             |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |					ТЧ.Номенклатура
		             |				ИЗ
		             |					Документ.ОтправкаПеремещений.РаспределениеЗатрат КАК ТЧ
		             |				ГДЕ
		             |					ТЧ.Ссылка = &Ссылка)
		             |	
		             |	ОБЪЕДИНИТЬ
		             |	
		             |	ВЫБРАТЬ
		             |		РНТовары.Номенклатура,
		             |		РНТовары.Партия
		             |	ИЗ
		             |		Документ.РасходнаяНакладная.Товары КАК РНТовары
		             |	ГДЕ
		             |		РНТовары.Ссылка В
		             |				(ВЫБРАТЬ
		             |					ТЧ.ТоварныйДокумент
		             |				ИЗ
		             |					Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
		             |				ГДЕ
		             |					ТЧ.Ссылка = &Ссылка)
		             |		И РНТовары.Номенклатура В
		             |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |					ТЧ.Номенклатура
		             |				ИЗ
		             |					Документ.ОтправкаПеремещений.РаспределениеЗатрат КАК ТЧ
		             |				ГДЕ
		             |					ТЧ.Ссылка = &Ссылка)) КАК Свод
		             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |			ОтправкаПеремещенийРаспределениеЗатрат.Номенклатура КАК Номенклатура,
		             |			ОтправкаПеремещенийРаспределениеЗатрат.Затрата КАК Затрата,
		             //|			СУММА(ОтправкаПеремещенийРаспределениеЗатрат.Количество) КАК Количество,
		             |			СУММА(ОтправкаПеремещенийРаспределениеЗатрат.Цена) КАК Цена
		             |		ИЗ
		             |			Документ.ОтправкаПеремещений.РаспределениеЗатрат КАК ОтправкаПеремещенийРаспределениеЗатрат
		             |		ГДЕ
		             |			ОтправкаПеремещенийРаспределениеЗатрат.Ссылка = &Ссылка
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			ОтправкаПеремещенийРаспределениеЗатрат.Номенклатура,
		             |			ОтправкаПеремещенийРаспределениеЗатрат.Затрата) КАК РаспрЗатрат
		             |		ПО Свод.Номенклатура = РаспрЗатрат.Номенклатура";
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запр.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
			НаборЗаписей.Записать(Истина);
			
		Иначе	
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовЗапись = НаборЗаписей.Добавить(); 
				НовЗапись.Период		= Дата;
				НовЗапись.Источник 		= Ссылка;
				НовЗапись.Номенклатура 	= Выборка.Номенклатура;	
			 	НовЗапись.Затрата		= Выборка.Затрата;
				НовЗапись.Партия 		= Выборка.Партия; 
				//НовЗапись.Количество	= Выборка.Количество;
				НовЗапись.Сумма 		= Выборка.Цена;
				НовЗапись.Валюта 		= ВалютаЗатрат;  
				НовЗапись.Зарегистрировано = ТекущаяДата();
			    НовЗапись.СуммаВБазВалюте  = РаботаСВалютой.Пересчитать2025(Выборка.Цена, ВалютаЗатрат, ВалютаДоллар, Фирма, Дата); 
			КонецЦикла;
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	Иначе   
		
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// РС СостоянияИнвойсов - установим пустыми статусы инвойсов, имеющие статус "ВПути", и записанные тек.отправкой (если не существует др.отправок таких инвойсов)
	
	 //ИнвойсыТекущейПроведеннойОтправки = ИнвойсыТекущейПроведеннойОтправки();
	 //Для каждого текИнвойс Из ИнвойсыТекущейПроведеннойОтправки Цикл
	 //   Если текИнвойс.Статус = Перечисления.СтатусыИнвойса.ВПути И НЕ текИнвойс.БылиОтправки Тогда
	 //   	ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(текИнвойс.Инвойс, Перечисления.СтатусыИнвойса.ПустаяСсылка(), , , Ссылка); 
	 //   	//ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(текИнвойс.Инвойс, Перечисления.СтатусыИнвойса.НеОтправлен, , , Ссылка); 
	 //   КонецЕсли;
	 //КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	ЕстьЗатраты = РаспределениеЗатрат.Количество() > 0;
	Сумма = Затраты.Итог("Сумма");
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект, Ложь);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 

КонецПроцедуры


Функция ИнвойсыТекущейПроведеннойОтправки()

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Регистратор", Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |	СостоянияИнвойсов.Статус КАК Статус,
	             |	ВЫБОР
	             |		КОГДА ПредыдущиеОтправки.Инвойс ЕСТЬ NULL
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК БылиОтправки
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО ОтправкаИнвойсов.Инвойс = СостоянияИнвойсов.Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |			МИНИМУМ(ОтправкаИнвойсов.Поставка) КАК Поставка
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |			И ОтправкаИнвойсов.Регистратор <> &Регистратор
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ОтправкаИнвойсов.Инвойс) КАК ПредыдущиеОтправки
	             |		ПО ОтправкаИнвойсов.Инвойс = ПредыдущиеОтправки.Инвойс
	             |			И ОтправкаИнвойсов.Поставка = ПредыдущиеОтправки.Поставка
	             |ГДЕ
	             |	ОтправкаИнвойсов.Регистратор = &Регистратор";
    Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка;

КонецФункции 

Функция ИнвойсыУдаленныеИзОтправки()

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Регистратор", Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |	СостоянияИнвойсов.Статус КАК Статус,
	             |	ВЫБОР
	             |		КОГДА ПредыдущиеОтправки.Инвойс ЕСТЬ NULL
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК БылиОтправки
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО ОтправкаИнвойсов.Инвойс = СостоянияИнвойсов.Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |			МИНИМУМ(ОтправкаИнвойсов.Поставка) КАК Поставка
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |			И ОтправкаИнвойсов.Регистратор <> &Регистратор
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ОтправкаИнвойсов.Инвойс) КАК ПредыдущиеОтправки
	             |		ПО ОтправкаИнвойсов.Инвойс = ПредыдущиеОтправки.Инвойс
	             |			И ОтправкаИнвойсов.Поставка = ПредыдущиеОтправки.Поставка
	             |ГДЕ
	             |	ОтправкаИнвойсов.Регистратор = &Регистратор
	             |	И НЕ ОтправкаИнвойсов.Инвойс В
	             |				(ВЫБРАТЬ
	             |					ТЧ.Инвойс
	             |				ИЗ
	             |					Документ.Отправка.Инвойсы КАК ТЧ
	             |				ГДЕ
	             |					ТЧ.Ссылка = &Регистратор)";
    Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка;

КонецФункции // УдаленныеИзОтправкиИнвойсы()

Функция ПредыдущиеСтатусыИнвойсов(Инвойсы) 
	
	Результат = Новый Соответствие;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Инвойсы", Инвойсы);
	Запр.Текст = "ВЫБРАТЬ
	             |	Инвойсы.Инвойс,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ОтправкиОприход.Оприходование, 0) = 0
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК ЕстьОприходование,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ОтправкиОприход.Отправки, 0) = 0
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК ЕстьОтправка,
	             |	СостоянияИнвойсов.Статус КАК Статус
	             |ИЗ
	             |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |		Инвойсы.Ссылка КАК Инвойс
	             |	ИЗ
	             |		Документ._Инвойс КАК Инвойсы
	             |	ГДЕ
	             |		Инвойсы.Ссылка В(&Инвойсы)) КАК Инвойсы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ВКД_ОприходованиеНоменклатурыОстатки.Документ КАК Инвойс,
	             |			СУММА(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток) КАК Оприходование,
	             |			0 КАК Отправки
	             |		ИЗ
	             |			РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки КАК ВКД_ОприходованиеНоменклатурыОстатки
	             |		ГДЕ
	             |			ВКД_ОприходованиеНоменклатурыОстатки.Документ В(&Инвойсы)
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ВКД_ОприходованиеНоменклатурыОстатки.Документ
	             |		
	             |		ОБЪЕДИНИТЬ
	             |		
	             |		ВЫБРАТЬ
	             |			ОтправкаИнвойсов.Инвойс,
	             |			0,
	             |			СУММА(ОтправкаИнвойсов.ОжидаемыеПоставки)
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.ОжидаемыеПоставки < 0
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ОтправкаИнвойсов.Инвойс) КАК ОтправкиОприход
	             |		ПО (ОтправкиОприход.Инвойс = Инвойсы.Инвойс)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО Инвойсы.Инвойс = СостоянияИнвойсов.Инвойс";
     Выборка = Запр.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	Результат.Вставить(Выборка.Инвойс, 
							Новый Структура("Статус, ЕстьОприходование, ЕстьОтправка",
											Выборка.Статус, Выборка.ЕстьОприходование, Выборка.ЕстьОтправка));
	 КонецЦикла;  
	 Возврат Результат; 
	 
КонецФункции 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Фирма 		= гоФирма();
	КемСоздан 	= гоПользователь(); 
	Создан 		= ТекущаяДатаСеанса(); 
    ВалютаЗатрат= омСервер.ПолучитьВалюту("USD");
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
